<?

	ini_set('display_errors', 1);
	error_reporting(E_ERROR);
	error_reporting(E_ALL || ~E_NOTICE);

    include_once "lib/libdb.php";
	include_once "lib/libmodlist.php";

	date_default_timezone_set('Asia/Seoul');

	//ini_set( 'include_path', ini_get('include_path').':../lib:../lib/jpgraph' );
	//session_start();

    header('Content-Type: text/html; charset=utf-8');

	$DB = new dbconn( "roomreserve", "localhost", "root", "medinfo" );

	$colors = array( "#0072bc", "#00a651", "#f7941d", "ff66cc", "9999ff", "33ccff", "ccff33" );

	$confroom_group = array(
		"2층 회의실" => array( "2층 2303 회의실 1(원형)", "2층 2302 회의실 2", "2층 2301 회의실 3" ),
		"3층 회의실" => array( "3층 3301 회의실 1(원형)", "3층 3220 소회의실 1", "3층 3221 소회의실 2", "3층 3222 소회의실 3" ),
		"4층 회의실" => array( "4층 4301 회의실 1(원형)", "4층 4220 소회의실 1", "4층 4221 소회의실 2", "4층 4222 소회의실 3" )
	);

	$confroom = array(
		"2층 2303 회의실 1(원형)", "2층 2302 회의실 2", "2층 2301 회의실 3",
		"3층 3301 회의실 1(원형)", "3층 3220 소회의실 1", "3층 3221 소회의실 2", "3층 3222 소회의실 3",
		"4층 4301 회의실 1(원형)", "4층 4220 소회의실 1", "4층 4221 소회의실 2", "4층 4222 소회의실 3"
	);

	$

	$key = "1dasd12WESA12dsaasd456TGDFsd";

	$table = $DB->table( "deviceinfo" );
	list( $room_name ) = $table->selectfetch( "", "di_room", "di_ip='".$_SERVER["REMOTE_ADDR"]."'" );
	//$room_name = "2층 2303 회의실 1(원형)";

	function time_format( $time_str ) {
		$time = substr( $time_str, 0, 5 );
		$apm = substr( $time_str, 6, 2 );
		list( $h, $m ) = explode( ":", $time );
		if ( $apm == "PM" ) $h += 12;

		return sprintf( "%02d%02d", $h, $m );
	}

	function time_human( $time_str ) {
		return substr( $time_str, 0, 2 ).":".substr( $time_str, 2, 2 );
	}

	function get_notice_str() {
		global $DB;

		$table = $DB->table( "noticeinfo" );
		$table->select( "*", "ni_active=1", "order by ni_seq desc" );

		$str = "";

		$cnt = 1;
		while( $data = $table->fetch() ) {
			$str .= $cnt.". ".$data["ni_subject"];
			$str .= "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;";
			$str .= "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;";
			$cnt++;
		}

		return $str;
	}

	$mem_regno = array (
		"00871" => "안용민",
		"01029" => "이재영",
		"00824" => "강웅구",
		"65378" => "함봉진",
		"00719" => "김석화",
		"00888" => "최태현",
		"65499" => "권운용",
		"00856" => "서길준",
		"65311" => "장학",
		"65706" => "진웅식",
		"00702" => "민경원",
		"01049" => "이경민",
		"65542" => "문지연",
		"65545" => "최승홍",
		"00724" => "한문희",
		"65678" => "윤태진",
		"65489" => "김효철",
		"00760" => "한준구",
		"00957" => "정진욱",
		"00960" => "김현진",
		"01061" => "김정훈",
		"65364" => "제환준",
		"00905" => "문우경",
		"00959" => "조나리야",
		"65546" => "장정민",
		"00931" => "문형곤",
		"00873" => "조태준",
		"00559" => "최인호",
		"65458" => "이동연",
		"00944" => "채종희",
		"00822" => "김기중",
		"00896" => "김한석",
		"00580" => "최중환",
		"65461" => "김이경",
		"00704" => "정해일",
		"65654" => "강희경",
		"00946" => "고정민",
		"00747" => "하일수",
		"00742" => "김규한",
		"65689" => "이동훈",
		"00921" => "권오상",
		"65656" => "조성진",
		"00759" => "정진호",
		"00588" => "조광현",
		"00895" => "고재성",
		"00582" => "이환종",
		"00920" => "최은화",
		"01058" => "윤기욱",
		"01022" => "박영주",
		"00890" => "신찬수",
		"00893" => "박도준",
		"00815" => "박경수",
		"65167" => "조영민",
		"65484" => "정혜승",
		"00945" => "신충호",
		"00703" => "양세원",
		"00833" => "이명철",
		"65173" => "이상훈",
		"00779" => "백구현",
		"00862" => "이영호",
		"01935" => "한혁수",
		"00774" => "김희중",
		"65172" => "유원준",
		"00950" => "유정준",
		"00904" => "장봉순",
		"00805" => "정천기",
		"00752" => "김동규",
		"65722" => "김진욱",
		"00952" => "정현태",
		"00915" => "김정은",
		"65120" => "김만호",
		"82633" => "김정은",
		"00798" => "전범석",
		"65629" => "김한준",
		"00925" => "김동영",
		"65676" => "원태빈",
		"65675" => "권성근",
		"01060" => "김현직",
		"01020" => "박무균",
		"00784" => "오승하",
		"00835" => "김수웅",
		"00855" => "서대헌",
		"65480" => "박관진",
		"00902" => "오승준",
		"00706" => "백재승",
		"00797" => "김현회",
		"00954" => "곽철",
		"00949" => "김한수",
		"65381" => "한일규",
		"00778" => "오명돈",
		"01043" => "김남중",
		"65334" => "박완범",
		"65538" => "최평균",
		"00775" => "윤병우",
		"65452" => "송은영",
		"65474" => "송상훈",
		"65691" => "김택수",
		"00874" => "하종원",
		"00942" => "민승기",
		"01025" => "이마리아",
		"65159" => "구승엽",
		"00864" => "유철규",
		"00750" => "김영환",
		"00934" => "임재준",
		"65318" => "이상민",
		"01976" => "이창훈",
		"65621" => "박영식",
		"65630" => "정진욱",
		"65633" => "성문우",
		"01055" => "김수진",
		"00745" => "박성섭",
		"00884" => "김효수",
		"65415" => "조현재",
		"00809" => "구본권",
		"65256" => "강현재",
		"65705" => "양한모",
		"00898" => "김승기",
		"00717" => "왕규창",
		"65640" => "피지훈",
		"65384" => "주건",
		"65120" => "김만호",
		"65380" => "박철기",
		"01028" => "이상건",
		"00900" => "박기호",
		"00878" => "허장원",
		"00955" => "유형곤",
		"00722" => "유영석",
		"00804" => "조상헌",
		"01017" => "강혜련",
		"65379" => "박흥우",
		"00911" => "김연수",
		"00918" => "김동기",
		"65164" => "주권욱",
		"00699" => "한진석",
		"65326" => "성정준",
		"00936" => "김용진",
		"65534" => "이승표",
		"65361" => "이해영",
		"00787" => "서경석",
		"01056" => "이광웅",
		"00780" => "전종관",
		"00943" => "박중신",
		"00731" => "윤보현",
		"00735" => "최영민",
		"65327" => "이승훈",
		"00783" => "안규리",
		"65404" => "오국환",
		"65491" => "양재석",
		"00883" => "박희평",
		"00826" => "임영진",
		"00807" => "방문석",
		"00964" => "정선근",
		"65585" => "오병모",
		"65660" => "김기원",
		"65284" => "신형익",
		"65522" => "임홍국",
		"00729" => "송영욱",
		"00917" => "이은영",
		"00939" => "이은봉",
		"00956" => "김정훈",
		"65177" => "김미금",
		"65583" => "오주연",
		"00764" => "위원량",
		"86160" => "서종모",
		"65716" => "정은재",
		"00903" => "장진영",
		"65483" => "최의근",
		"00881" => "이준호",
		"00846" => "김희찬",
		"00963" => "최영빈",
		"00744" => "권준수",
		"00948" => "김붕년",
		"00928" => "최수희",
		"00947" => "이동영",
		"00932" => "이유진",
		"00882" => "조비룡",
		"65523" => "김치헌",
		"01018" => "정기영",
		"65524" => "김도균",
		"65316" => "신상도",
		"01911" => "송경준",
		"00961" => "곽영호",
		"65416" => "김세훈",
		"05081" => "김지형",
		"01062" => "김상화",
		"00844" => "김종효",
		"00711" => "김인원",
		"00799" => "김우선",
		"00930" => "이정민",
		"65395" => "이창현",
		"00958" => "조정연",
		"65265" => "이현주",
		"65419" => "김세형",
		"65182" => "홍성환",
		"65465" => "최자영",
		"65709" => "최영훈",
		"00926" => "손철호",
		"65516" => "윤형진",
		"00808" => "김용철",
		"00935" => "오세일",
		"00933" => "박상민",
		"00843" => "신민섭",
		"01027" => "김재원"
	);

?>